    program Test5
    implicit complex*16(c,w,z), real*8(a-b,d-h,o-v,x-y)
    dimension ztemp(29), betam(29), qwork(2000), aC(1)
    dimension z1(29), z2(29), z3(29), z(29), x2(29), x3(29), x4(29)
    !--------------------------------------------------------------------------
    d = 3.;
    h = 2;
    e = 1;
    !--------------------------------------------------------------------------
    pi =  dacos(-1.d0)		  ! число пи
    data zi   /(0.d0, 1.d0) / ! мнимая единица
    !   print*,s02
    !	Исходные данные:
    n = 1       ! количество линий
    nn = 29     ! Общее кол-во вершин в исх. многоугол
    r = d/2.
    iprint =-1
    iguess = 1

    m=24;   ! m - кол-во углов по окружности сечения каждого провода СЛ.

    z1(1) = 0
    do i = 1, m+1
        alf = 2./m
        z1(i+1) = zi*(h+r) + r*exp(-zi*(i+5)*alf*pi); ! Коорд.вершин n+1
    end do
    z1(27) = 0
    z1(28) = (1.d20,1.d20)
    z1(29) = -1

    ! Углы при вершинах

    betam(1) = -0.5
    betam(2) = -0.5 + alf/2.
    do i = 1, m-1
        betam(i+2) = alf;
    end do
    betam(26) = -0.5 + alf/2.
    betam(27) = -0.5
    betam(28) = -2.0
    betam(29) =  0.0
    ! Контрольная печать исходных данных
    !	  do 11 i = 1,nn
    !11	  write(6,100) i, z1(i)
    !100	  format(' z1=wk =', i3, 2x, f6.3, 1x, f6.3)
    !	  pause '----------------------------'

    z1c = dcmplx(h+r, h+r) ! Задание конформ. центра z10 в исх. многоугол. z1

    nptsq = 6
    call qinit(nn,betam,nptsq,qwork)

    do 1 k = 1,nn
        z(k) = exp(dcmplx(0.d0, k-nn))
        !	print*, k, '  ', z(k)
1   continue
    !   pause '*****'

    tol = 1d-6	! 1.d-14

    call scsolv(iprint,iguess,tol,errest,nn,c,z,z1c,z1,betam,nptsq,qwork)
    !z1(k) - вершины многоугольника (в оригинале были обозначены как w(k) )
    !z(k) -  круговая каноническая область

    !Дробно-линейное отображение круга z(k) на верх.полуплоскость
    z20 =zi;				     ! Задание конформ.центра z20 на верхней полуплоскости z2
    z201=-zi;						!z3
    do 2 k = 1, nn-1
        z2(k)=(z(k)*z201-z20)/(z(k)-1)  ! отображающая функция
        x2(k)=dreal(z2(k));			  ! выделение веществен.части (т.е. отбрасывание мнимой)
        print '(''z2 x2 '',i2, '' ('',f12.6,'','',f9.6'')'', f12.6)', k, z2(k), x2(k)
2   continue

    ! Нормировка к отрезку (-1...+1) на оси х3
    do 3 k = 1,nn-1
        x3(k) = 2*(x2(k) - x2(1)) / (x2(nn-2) - x2(1)) - 1.
        ! 	  write(6,101) k, x3(k)
        !101	  format(' x3 =', i3, 4x, f12.9 )
3   continue

    ! Выделение краевых точек электродов на оси х4
    x4(1)=x3(1);
    x4(2)=x3(2);
    x4(3)=x3(26);
    x4(4)=x3(27);
    print*,'----------------------------'

    do 5 i=1,2*n
        !	  write(6,102) i, x4(i)
5   continue
    !102	  format(' x4 =', i3, 2x, f12.9)
    print*,'----------------------------'
    !--------------------------------------------------------------------------
    n2 = 1
    M=1000
    call GHIONE(x4,aC,n2,M)

    ! Удаление "лишних" строк и столбцов, соответств. "лишним" электродам
    !call refor(aC,bC,n)
    print*,'Capacitance matrix all in air bC'
    ! Матрица емкостей в воздухе
    print*,aC(1)
    !--------------------------------------------------------------------------
    ! Расчёт ёмкостей в левой половине в диэлектрической подложки (substrate)
    a=aw/2;
    b=s(1)
    xs1=cosh(pi*a/h)
    xs2=cosh(pi*(a+b)/h) ! Отображение полосы на верх. п/плоскост
    ak=sqrt((xs1-1)/(xs2-1))
    dC1=aKK1(ak)
    ! Расчёт ёмкостей в правой половине в диэлектрической подложки (substrate)
    a=aw/2;
    b=s(2)
    xs1=cosh(pi*a/h)
    xs2=cosh(pi*(a+b)/h) ! Отображение полосы на верх. п/плоскост
    ak=sqrt((xs1-1)/(xs2-1))
    dC2=aKK1(ak)
    ! Расчёт ёмкостей в диэлектрической подложки (substrate)
    dC12=dC1+dC2
    dC = dC * e
    dL= 0.4*pi/(aC(1)*2)  !индуктивность
    dZ0= sqrt(1.d6*dL/dC) !импеданс
    em = (dC/8.854)/(aC(1)*2) !Модальная диэлектрическая проницаемость
    print*,'Capacitance matrix [C] (pF/m)'
    print*,dC
    print*,'Inductance matrix [L] (nH/m)'
    print*,dL
    !--------------------------------------------------------------------------
    end

